data_analysis/repo/gpu_log/benchmark_20250630_111610_mDeepSeek-R1-Distill-Llama-70B_np300_mc90_in1024_out1024.log
INFO 06-30 11:16:16 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=90, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=300, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=1024', 'output_len=1024', 'serving=sglang'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 90
100%|██████████| 300/300 [00:54<00:00,  5.47it/s]
============ Serving Benchmark Result ============
Successful requests:                     300       
Benchmark duration (s):                  54.80     
Total input tokens:                      306900    
Total generated tokens:                  228722    
Request throughput (req/s):              5.47      
Output token throughput (tok/s):         4173.38   
Total Token throughput (tok/s):          9773.25   
---------------Time to First Token----------------
Mean TTFT (ms):                          223.89    
Median TTFT (ms):                        217.59    
P99 TTFT (ms):                           506.45    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          18.49     
Median TPOT (ms):                        18.85     
P99 TPOT (ms):                           20.34     
---------------Inter-token Latency----------------
Mean ITL (ms):                           18.32     
Median ITL (ms):                         16.83     
P99 ITL (ms):                            45.01     
==================================================