data_analysis/repo/gpu_log/benchmark_20250630_123050_mDeepSeek-R1-Distill-Llama-70B_np300_mc120_in2048_out512.log
INFO 06-30 12:30:54 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=120, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=300, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=2048', 'output_len=512', 'serving=sglang'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=2048, random_output_len=512, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 120
100%|██████████| 300/300 [00:30<00:00,  9.92it/s]
============ Serving Benchmark Result ============
Successful requests:                     300       
Benchmark duration (s):                  30.24     
Total input tokens:                      614100    
Total generated tokens:                  120181    
Request throughput (req/s):              9.92      
Output token throughput (tok/s):         3974.02   
Total Token throughput (tok/s):          24280.42  
---------------Time to First Token----------------
Mean TTFT (ms):                          1134.59   
Median TTFT (ms):                        1122.51   
P99 TTFT (ms):                           2836.18   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.70     
Median TPOT (ms):                        25.17     
P99 TPOT (ms):                           143.34    
---------------Inter-token Latency----------------
Mean ITL (ms):                           24.77     
Median ITL (ms):                         18.52     
P99 ITL (ms):                            90.44     
==================================================