data_analysis/repo/gpu_log/benchmark_20250630_132827_mDeepSeek-R1-Distill-Llama-70B_np300_mc150_in1536_out2048.log
INFO 06-30 13:28:33 [__init__.py:243] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=150, model='deepseek-ai/DeepSeek-R1-Distill-Llama-70B', tokenizer=None, use_beam_search=False, num_prompts=300, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['input_len=1536', 'output_len=2048', 'serving=sglang'], result_dir='gpu_log', result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1536, random_output_len=2048, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 150
100%|██████████| 300/300 [01:06<00:00,  4.48it/s]
============ Serving Benchmark Result ============
Successful requests:                     300       
Benchmark duration (s):                  66.99     
Total input tokens:                      460500    
Total generated tokens:                  315261    
Request throughput (req/s):              4.48      
Output token throughput (tok/s):         4706.23   
Total Token throughput (tok/s):          11580.59  
---------------Time to First Token----------------
Mean TTFT (ms):                          499.15    
Median TTFT (ms):                        568.32    
P99 TTFT (ms):                           1007.11   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          24.48     
Median TPOT (ms):                        25.24     
P99 TPOT (ms):                           29.60     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.18     
Median ITL (ms):                         21.53     
P99 ITL (ms):                            70.60     
==================================================